; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=70, out_folder=htg/blocksworld/training, instance_id=50, seed=2074, goal_proportion=0.1

(define (problem blocksworld-50)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 - object)
 (:init 
    (arm-empty)
    (clear b51)
    (on b51 b21)
    (on b21 b67)
    (on-table b67)
    (clear b59)
    (on b59 b52)
    (on b52 b38)
    (on b38 b5)
    (on b5 b33)
    (on-table b33)
    (clear b60)
    (on b60 b50)
    (on-table b50)
    (clear b28)
    (on b28 b37)
    (on b37 b25)
    (on b25 b48)
    (on b48 b44)
    (on b44 b43)
    (on-table b43)
    (clear b47)
    (on-table b47)
    (clear b15)
    (on b15 b53)
    (on b53 b11)
    (on b11 b3)
    (on b3 b65)
    (on b65 b24)
    (on-table b24)
    (clear b36)
    (on b36 b7)
    (on b7 b26)
    (on-table b26)
    (clear b49)
    (on-table b49)
    (clear b31)
    (on b31 b17)
    (on b17 b19)
    (on b19 b63)
    (on-table b63)
    (clear b54)
    (on-table b54)
    (clear b16)
    (on b16 b1)
    (on-table b1)
    (clear b13)
    (on b13 b58)
    (on-table b58)
    (clear b12)
    (on-table b12)
    (clear b69)
    (on-table b69)
    (clear b22)
    (on-table b22)
    (clear b41)
    (on b41 b34)
    (on b34 b56)
    (on b56 b46)
    (on b46 b27)
    (on b27 b42)
    (on-table b42)
    (clear b8)
    (on b8 b23)
    (on b23 b64)
    (on b64 b10)
    (on b10 b62)
    (on b62 b55)
    (on b55 b61)
    (on b61 b57)
    (on b57 b18)
    (on b18 b70)
    (on b70 b20)
    (on-table b20)
    (clear b66)
    (on b66 b39)
    (on b39 b30)
    (on b30 b2)
    (on b2 b40)
    (on b40 b14)
    (on b14 b9)
    (on b9 b4)
    (on b4 b45)
    (on-table b45)
    (clear b6)
    (on b6 b29)
    (on b29 b68)
    (on b68 b32)
    (on b32 b35)
    (on-table b35))
 (:goal  (and 
    (clear b3)
    (on b3 b1)
    (on b1 b4)
    (on b4 b2)
    (on b2 b7)
    (on b7 b5)
    (on b5 b6)
    (on-table b6))))

; plan
1. (unstack b6 b29)
   deleted: (on b6 b29) (clear b6) (arm-empty)
   added: (holding b6) (clear b29)
   goals met: 0 of 8
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 8
3. (unstack b15 b53)
   deleted: (on b15 b53) (clear b15) (arm-empty)
   added: (holding b15) (clear b53)
   goals met: 1 of 8
4. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 8
5. (unstack b53 b11)
   deleted: (on b53 b11) (clear b53) (arm-empty)
   added: (holding b53) (clear b11)
   goals met: 1 of 8
6. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 1 of 8
7. (unstack b11 b3)
   deleted: (on b11 b3) (clear b11) (arm-empty)
   added: (holding b11) (clear b3)
   goals met: 2 of 8
8. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 8
9. (unstack b16 b1)
   deleted: (on b16 b1) (clear b16) (arm-empty)
   added: (holding b16) (clear b1)
   goals met: 2 of 8
10. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 2 of 8
11. (unstack b3 b65)
   deleted: (on b3 b65) (clear b3) (arm-empty)
   added: (holding b3) (clear b65)
   goals met: 1 of 8
12. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 3 of 8
13. (unstack b59 b52)
   deleted: (on b59 b52) (clear b59) (arm-empty)
   added: (holding b59) (clear b52)
   goals met: 3 of 8
14. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 3 of 8
15. (unstack b52 b38)
   deleted: (on b52 b38) (clear b52) (arm-empty)
   added: (holding b52) (clear b38)
   goals met: 3 of 8
16. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 3 of 8
17. (unstack b38 b5)
   deleted: (on b38 b5) (clear b38) (arm-empty)
   added: (holding b38) (clear b5)
   goals met: 3 of 8
18. (putdown b38)
   deleted: (holding b38)
   added: (clear b38) (arm-empty) (on-table b38)
   goals met: 3 of 8
19. (unstack b5 b33)
   deleted: (on b5 b33) (clear b5) (arm-empty)
   added: (holding b5) (clear b33)
   goals met: 3 of 8
20. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 4 of 8
21. (unstack b36 b7)
   deleted: (on b36 b7) (clear b36) (arm-empty)
   added: (holding b36) (clear b7)
   goals met: 4 of 8
22. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 4 of 8
23. (unstack b7 b26)
   deleted: (on b7 b26) (clear b7) (arm-empty)
   added: (holding b7) (clear b26)
   goals met: 4 of 8
24. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 5 of 8
25. (unstack b66 b39)
   deleted: (on b66 b39) (clear b66) (arm-empty)
   added: (holding b66) (clear b39)
   goals met: 5 of 8
26. (putdown b66)
   deleted: (holding b66)
   added: (clear b66) (arm-empty) (on-table b66)
   goals met: 5 of 8
27. (unstack b39 b30)
   deleted: (on b39 b30) (clear b39) (arm-empty)
   added: (holding b39) (clear b30)
   goals met: 5 of 8
28. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 5 of 8
29. (unstack b30 b2)
   deleted: (on b30 b2) (clear b30) (arm-empty)
   added: (holding b30) (clear b2)
   goals met: 5 of 8
30. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 5 of 8
31. (unstack b2 b40)
   deleted: (on b2 b40) (clear b2) (arm-empty)
   added: (holding b2) (clear b40)
   goals met: 5 of 8
32. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 6 of 8
33. (unstack b40 b14)
   deleted: (on b40 b14) (clear b40) (arm-empty)
   added: (holding b40) (clear b14)
   goals met: 6 of 8
34. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 6 of 8
35. (unstack b14 b9)
   deleted: (on b14 b9) (clear b14) (arm-empty)
   added: (holding b14) (clear b9)
   goals met: 6 of 8
36. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 6 of 8
37. (unstack b9 b4)
   deleted: (on b9 b4) (clear b9) (arm-empty)
   added: (holding b9) (clear b4)
   goals met: 6 of 8
38. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 6 of 8
39. (unstack b4 b45)
   deleted: (on b4 b45) (clear b4) (arm-empty)
   added: (holding b4) (clear b45)
   goals met: 6 of 8
40. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 7 of 8
41. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 5 of 8
42. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 8
43. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 8
44. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 7 of 8
45. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 8
46. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 8 of 8
